Revit 2018 API
ExportLinetypeTable.Item Property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public ExportLinetypeInfo this[
	ExportLinetypeKey linetypeKey
] { get; set; }
Visual Basic
Public Default Property Item ( _
	linetypeKey As ExportLinetypeKey _
) As ExportLinetypeInfo
	Get
	Set
Visual C++
public:
virtual property ExportLinetypeInfo^ default[ExportLinetypeKey^ linetypeKey] {
	ExportLinetypeInfo^ get (ExportLinetypeKey^ linetypeKey) sealed;
	void set (ExportLinetypeKey^ linetypeKey, ExportLinetypeInfo^ value) sealed;
}
Parameters
linetypeKey
Type: Autodesk.Revit.DB.ExportLinetypeKey
See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace